#include <stdio.h>      // ইনপুট ও আউটপুটের জন্য stdio হেডার ফাইল
#include <limits.h>     // INT_MAX ব্যবহারের জন্য এই হেডার ফাইল

int main() { 
   int n, x;                     // n ইনপুট সংখ্যা গোনার জন্য, x প্রতিটি ইনপুট রাখার জন্য
   scanf("%d", &n);              // ইউজার থেকে সংখ্যা ইনপুট নিচ্ছে (কতগুলো ইনপুট নেবে)

   int min = INT_MAX;           // সর্বনিম্ন সংখ্যার জন্য min, শুরুতে খুব বড় মান দিয়ে initialize করা হয়েছে

   for(int i = 0; i < n; i++){  // n বার লুপ চলবে
       scanf("%d", &x);         // প্রতিবার একটি করে সংখ্যা ইনপুট নিবে
       if(x < min){             // যদি বর্তমান সংখ্যা min থেকে ছোট হয়
           min = x;             // তাহলে min আপডেট করবে
       }
   }  

   printf("%d ", min);          // সব থেকে ছোট সংখ্যাটি প্রিন্ট করবে

   return 0;                    // প্রোগ্রাম সফলভাবে শেষ
}

/*
Input:
6
50 23 78 12 90 33

Output:
12

Note: ইউজার যতগুলো সংখ্যা দেবে (এই ক্ষেত্রে ৬টি), তাদের মধ্যে সবচেয়ে ছোট সংখ্যাটি খুঁজে বের করে প্রিন্ট করবে।
*/
