#include <stdio.h>

// 🔹 দুটি সংখ্যার যোগফল রিটার্ন করে
int sum(int num1, int num2){
    int ans = num1 + num2;
    return ans;
}

int main() { 
    int a, b;
    scanf("%d %d", &a, &b);     // 🔸 দুটি সংখ্যা ইনপুট নিচ্ছে

    int val = sum(a, b);        // 🔸 sum ফাংশনে পাঠানো হচ্ছে এবং রিটার্ন ভ্যালু নেওয়া হচ্ছে
    printf("%d", val);          // 🔸 রেজাল্ট প্রিন্ট করা হচ্ছে

    return 0;
}


/**
Input:
10 25

Output:
35

🔍 Short Note:
এই প্রোগ্রামে ইউজার দুটি সংখ্যা ইনপুট দেয়, এবং `sum()` নামক একটি ফাংশনের মাধ্যমে ওই দুটি সংখ্যার যোগফল বের করে তা প্রিন্ট করে। ফাংশনের সাহায্যে কোডকে modular করা হয়েছে যা রিইউজযোগ্য ও বুঝতে সহজ।

🕒 Time Complexity (TC):
O(1) → কারণ কেবল দুটি সংখ্যা নিয়ে সরাসরি অপারেশন করা হয়েছে।

💾 Space Complexity (SC):
O(1) → কারণ খুব অল্প সংখ্যক ভ্যারিয়েবল ব্যবহৃত হয়েছে, কোনো অতিরিক্ত মেমোরি ব্যবহার করা হয়নি।
**/
