
#include <stdio.h>            // স্ট্যান্ডার্ড ইনপুট-আউটপুট হেডার ফাইল 📚

int main()
{
    // char a[5] = {'p','a','i','s','\0'}; // এই লাইনটা কমেন্ট করা, তাই একে এক্ষেত্রে ইগনোর করবো ❌

    char s[30] = "Abdullah Al Zubaer";  // একটি ক্যারেক্টার অ্যারে তৈরি করলাম, যেখানে স্ট্রিং রাখা হয়েছে 📝
                                        // '\0' (null character) অটোমেটিকালি যুক্ত হয়ে যায় শেষে 🔚

    printf("%s", s);                    // স্ট্রিং প্রিন্ট করা হচ্ছে 🎯

    return 0;                           // প্রোগ্রাম সফলভাবে শেষ ✅
}

// Output: Abdullah Al Zubaer