#include <stdio.h>

int main() {
    int x;
    
    // ইউজার থেকে ইনপুট নিচ্ছি — যে সংখ্যাটার উপর চেক করবো
    scanf("%d", &x);

    // ধরি যে সংখ্যাটা প্রাইম (ধরি করে নিচ্ছি)
    int isPrime = 1;

    // প্রাইম চেক করার জন্য loop চালাচ্ছি 2 থেকে √x পর্যন্ত
    // কারণ কোনো সংখ্যা যদি প্রাইম না হয়, তাহলে √x এর আগেই কোনো একটা factor থাকবেই
    for (int i = 2; i * i <= x; i++) {

        // যদি x সংখ্যাটা i দিয়ে ভাগ যায় (মানে x % i == 0 হয়), তাহলে এটা প্রাইম না
        if (x % i == 0) {
            isPrime = 0; // ফ্ল্যাগ পরিবর্তন করলাম
            break; // একবারই divisor পেয়ে গেলে আর loop চালানোর দরকার নেই
        }
    }

    // এখন চেক করবো flag মানে isPrime কি true আছে?
    if (isPrime) {
        printf("YES\n"); // প্রাইম হলে YES প্রিন্ট করবো
    } else {
        printf("NO\n"); // না হলে NO প্রিন্ট করবো
    }

    return 0;
}


/*
Input: 7
Output: YES

Input: 15
Output: NO

*/